CSI API ETABS v1

# cDStSP16_13330_2011SetOverwrite Method

---

Sets the value of a steel design overwrite item

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetOverwrite(
    	string Name,
    	int Item,
    	double Value,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetOverwrite (
    	Name As String,
    	Item As Integer,
    	Value As Double,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cDStSP16_13330_2011
    Dim Name As String
    Dim Item As Integer
    Dim Value As Double
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetOverwrite(Name,
    	Item, Value, ItemType)

    int SetOverwrite(
    	String^ Name,
    	int Item,
    	double Value,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetOverwrite :
            Name : string *
            Item : int *
            Value : float *
            ?ItemType : eItemType
    (* Defaults:
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString
The name of an existing frame object or group, depending on the value of the
ItemType item.

Item

    Type: SystemInt32
This is an integer between 1 and 40, inclusive, indicating the overwrite item
considered

  1. Framing type (Not used anymore)
  2. Section class (Not used anymore)
  3. Service factor, GammaC
  4. Safety factor, GammaU
  5. Factor for L-Shapes, GammaC1
  6. Column buckling curve major
  7. Column buckling curve minor
  8. Is rolled section?
  9. Is beam top loaded?
  10. Consider deflection
  11. Deflection check type
  12. DL deflection limit, L/Value
  13. SDL + LL deflection limit, L/Value
  14. LL deflection limit, L/Value (Not used anymore)
  15. Total load deflection limit, L/Value
  16. Total-camber limit, L/Value
  17. DL deflection limit, absolute
  18. SDL + LL deflection limit, absolute
  19. LL deflection limit, absolute (Not used anymore)
  20. Total load deflection limit, absolute
  21. Total-camber limit, absolute
  22. Specified camber
  23. Net area to total area ratio
  24. Live load reduction factor
  25. Unbraced length ratio, Major
  26. Unbraced length ratio, Minor
  27. Unbraced length ratio, LTB
  28. Effective length factor, K1 Major (Not used anymore)
  29. Effective length factor, K1 Minor (Not used anymore)
  30. Effective length factor, K Major
  31. Effective length factor, K Minor
  32. Effective length factor, K LTB
  33. Characteristic strength, Ryn
  34. Design yield strength, Ry
  35. Design fracture strength, Ru
  36. Design shear strength, Rs
  37. Demand/capacity ratio limit
  38. Limit slenderness compression, A
  39. Limit slenderness compression, B
  40. Limit slenderness tension

Value

    Type: SystemDouble
The value of the considered overwrite item

  1. Framing type (Not used anymore)
  2. Section class (Not used anymore)
  3. Service factor, GammaC

Value >= 0; 0 means use program determined value

  4. Safety factor, GammaU

Value >= 0; 0 means use program determined value

  5. Factor for L-Shapes, GammaC1

Value >= 0; 0 means use program determined value

  6. Column buckling curve major
     * 0 = Program Determined
     * 1 = a
     * 2 = b
     * 3 = c
  7. Column buckling curve minor
     * 0 = Program Determined
     * 1 = a
     * 2 = b
     * 3 = c
  8. Is rolled section?
     * 0 = Program Determined
     * 1 = No
     * 2 = Yes
  9. Is beam top loaded?
     * 0 = Program Determined
     * 1 = No
     * 2 = Yes
  10. Consider deflection?
     * 0 = Program Determined
     * 1 = No
     * 2 = Yes
  11. Deflection check type
     * 0 = Program Determined
     * 1 = Ratio
     * 2 = Absolute
     * 3 = Both
  12. DL deflection limit, L/Value

Value >= 0; 0 means no check for this item

  13. SDL + LL deflection limit, L/Value

Value >= 0; 0 means no check for this item

  14. LL deflection limit, L/Value (Not used anymore)
  15. Total load deflection limit, L/Value

Value >= 0; 0 means no check for this item

  16. Total-camber limit, L/Value

Value >= 0; 0 means no check for this item

  17. DL deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  18. SDL + LL deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  19. LL deflection limit, absolute (Not used anymore)
  20. Total load deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  21. Total-camber limit, absolute

Value >= 0; 0 means no check for this item. [L]

  22. Specified camber

Value >= 0. [L]

  23. Net area to total area ratio

Value >= 0; 0 means use program default value

  24. Live load reduction factor

Value >= 0; 0 means use program determined value

  25. Unbraced length ratio, Major

Value >= 0; 0 means use program determined value

  26. Unbraced length ratio, Minor

Value >= 0; 0 means use program determined value

  27. Unbraced length ratio, LTB

Value >= 0; 0 means use program determined value

  28. Effective length factor, K1 Major (Not used anymore)
  29. Effective length factor, K1 Minor (Not used anymore)
  30. Effective length factor, K Major

Value >= 0; 0 means use program determined value

  31. Effective length factor, K Minor

Value >= 0; 0 means use program determined value

  32. Effective length factor, K LTB

Value >= 0; 0 means use program determined value

  33. Characteristic strength, Ryn

Value >= 0; 0 means use program determined value [F/L2]

  34. Design yield strength, Ry

Value >= 0; 0 means use program determined value [F/L2]

  35. Design fracture strength, Ru

Value >= 0; 0 means use program determined value [F/L2]

  36. Design shear strength, Rs

Value >= 0; 0 means use program determined value [F/L2]

  37. Demand/capacity ratio limit

Value >= 0; 0 means use program determined value

  38. Limit slenderness compression, A

Value >= 0; 0 means use program determined value

  39. Limit slenderness compression, B

Value >= 0; 0 means use program determined value

  40. Limit slenderness tension

Value >= 0; 0 means use program determined value

ItemType (Optional)

    Type: ETABSv1eItemType
This is one of the following items in the
eItemType enumeration:

  * Object = 0
  * Group = 1
  * SelectedObjects = 2

If this item is Objects, the
assignment is made to the frame object specified by the Name item.

If this item is Group, the
assignment is made to all frame objects in the group specified by the Name
item.

If this item is SelectedObjects,
the assignment is made to all selected frame objects and the Name item is
ignored.

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double
       Dim ProgDet As Boolean

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'set steel design code
       ret = SapModel.DesignSteel.SetCode("SP 16.13330.2011")

    'get overwrite item
       ret = SapModel.DesignSteel.SP16_13330_2011.GetOverwrite("8", 1, Value, ProgDet)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDStSP16_13330_2011 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com